In [3]:
import numpy as np
import pandas as pd

In [2]:
dict1={'Names':['Arvind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
dict1

{'Names': ['Arvind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [9]:
d1=pd.DataFrame(dict1)
d1

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    Siri  43.0      NaN

In [6]:
dict2={'Names':['Arvind','Samar',None,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',None]}
dict2

{'Names': ['Arvind', 'Samar', None, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', None]}

In [8]:
d2=pd.DataFrame(dict2)
d2

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2    None  32.0  Chennai
3    Siri  43.0     None

In [10]:
d1.dtypes,d2.dtypes

(Names     object
 Age      float64
 City      object
 dtype: object,
 Names     object
 Age      float64
 City      object
 dtype: object)

In [12]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [13]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

- np.nan: Means not a number, applicable for numerical columns only

- Generally data has some empty rows
- It is data problem
- If you read that kind of data you will see Null
- So you need to understand it is data corrupted or really a Null values are there

**Method-1**

**Fill with some random value**

In [14]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [15]:
d1.fillna(40)

    Names   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2      40  32.0  Chennai
3    Siri  43.0       40

**Method-2**

- We can fill the values w.r.t the columns also

In [17]:
d1['Age'].fillna(40,inplace=True)

In [18]:
d1

    Names   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    Siri  43.0      NaN

In [19]:
d1['Names'].fillna('Sandesh',inplace=True)
d1

     Names   Age     City
0   Arvind  40.0      Hyd
1    Samar  21.0      Blr
2  Sandesh  32.0  Chennai
3     Siri  43.0      NaN

**Method-3**


- bfill

- ffill

- pad

- backfill

In [21]:
dict2={'Names':['Arvind','Samar',None,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',None]}
d1=pd.DataFrame(dict2)

d1.fillna(method='bfill')  #* backfill / bfill: use next valid observation to fill gap.

C:\Users\hp\AppData\Local\Temp\ipykernel_20368\2944637739.py:6: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

    Names   Age     City
0  Arvind  21.0      Hyd
1   Samar  21.0      Blr
2    Siri  32.0  Chennai
3    Siri  43.0     None

In [22]:
dict2={'Names':['Arvind','Samar',None,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',None]}
d1=pd.DataFrame(dict2)

d1.fillna(method='bfill',axis=1)

C:\Users\hp\AppData\Local\Temp\ipykernel_20368\570663711.py:6: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill',axis=1)

    Names   Age     City
0  Arvind   Hyd      Hyd
1   Samar  21.0      Blr
2    32.0  32.0  Chennai
3    Siri  43.0     None

In [24]:
dict2={'Names':['Arvind','Samar',None,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',None]}
d1=pd.DataFrame(dict2)

d1.fillna(method='pad')  
# pad / ffill with previous value

C:\Users\hp\AppData\Local\Temp\ipykernel_20368\2589999049.py:6: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2   Samar  32.0  Chennai
3    Siri  43.0  Chennai

**Method-4**

**Mean median mode**

In [25]:
dict2={'Names':['Arvind','Samar',None,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',None]}
d1=pd.DataFrame(dict2)

In [26]:
# we already know we can fill with some values based on specific column using 
# d1.fillna(<randomNumber>)
# d1 represents all the columns 

age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [27]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [28]:
name_mode=d1['Names'].mode()
d1['Names'].fillna(name_mode)

0    Arvind
1     Samar
2      Siri
3      Siri
Name: Names, dtype: object

**Method-5**


**KNN imputer**

- KNN: K nearest Neighbours

- K is a hyper parameter means user can choose

- It is a distance metric: **Euclidian distance**

- KNN imputer will take the mean of the neighbours value

- The neighbours value can be provided by using value = k

- It is under skleanr package

- Under skern we have Imputer method

- Under imputer method wen have KNN package

In [33]:
from sklearn.impute import KNNImputer

im=KNNImputer()

im.fit_transform(d1[['Age']])

array([[32.],
       [21.],
       [32.],
       [43.]])